[
  {
    "dish_name": "Sauerbraten",
    "ingredients": {
      "beef": "200g",
      "peppercorns": "7 pcs",
      "onion": "1",
      "carrot": "1",
      "vinegar": "150ml"
    },
    "instructions": [
      "Marinate beef with peppercorns, onion, carrot, and vinegar.",
      "Leave to marinate for a few days.",
      "Roast the marinated beef.",
      "Serve and enjoy!"
    ],
    "history": "Sauerbraten is a traditional German pot roast, usually of beef. The meat is marinated before slow-cooking, resulting in a flavorful and tender dish. Its history dates back to the Middle Ages and it has remained a popular part of German cuisine."
  },
  {
    "dish_name": "Wiener Schnitzel",
    "ingredients": {
      "veal": "200g",
      "flour": "100g",
      "eggs": "2",
      "breadcrumbs": "150g",
      "lemon": "1"
    },
    "instructions": [
      "Flatten veal, dredge in flour.",
      "Dip in beaten eggs, then coat with breadcrumbs.",
      "Fry until golden brown.",
      "Serve with lemon slices."
    ],
    "history": "Wiener Schnitzel, a breaded and fried veal cutlet, is a classic Austrian dish. Its origins can be traced back to the 19th century, and it has become a staple in Austrian and German cuisine. The dish is typically served with lemon wedges and potato salad."
  },
  {
    "dish_name": "Bratwurst",
    "ingredients": {
      "pork": "400g",
      "onion": "1",
      "caraway seeds": "1 tsp",
      "salt": "1 tsp",
      "black pepper": "1/2 tsp"
    },
    "instructions": [
      "Grind pork and mix with finely chopped onion, caraway seeds, salt, and black pepper.",
      "Fill sausage casings with the mixture.",
      "Grill or pan-fry until cooked through.",
      "Serve with mustard and sauerkraut."
    ],
    "history": "Bratwurst, a type of German sausage made with pork, has a rich history dating back to medieval times. Originally created as a way to preserve meat, Bratwurst has evolved into a beloved grilled or pan-fried sausage, often enjoyed at festivals and gatherings."
  },
  {
    "dish_name": "Kartoffelsalat",
    "ingredients": {
      "potatoes": "500g",
      "onion": "1",
      "vegetable broth": "250ml",
      "vegetable oil": "3 tbsp",
      "mustard": "1 tbsp"
    },
    "instructions": [
      "Boil and slice potatoes.",
      "Mix with finely chopped onion.",
      "Whisk vegetable broth, vegetable oil, and mustard.",
      "Pour dressing over potatoes and toss."
    ],
    "history": "Kartoffelsalat, or German potato salad, has regional variations across Germany. This version, often associated with southern Germany, features boiled potatoes mixed with a flavorful dressing. Kartoffelsalat is a common side dish at German meals and celebrations."
  },
  {
    "dish_name": "Rouladen",
    "ingredients": {
      "beef slices": "6",
      "mustard": "3 tbsp",
      "bacon": "6 slices",
      "onion": "1",
      "pickles": "6"
    },
    "instructions": [
      "Spread mustard on beef slices.",
      "Place a slice of bacon, onion, and pickle on each slice.",
      "Roll up the slices and secure with toothpicks.",
      "Brown in a pan, then simmer in broth until tender."
    ],
    "history": "Rouladen, thin slices of beef filled with mustard, bacon, onions, and pickles, is a classic German dish with roots in traditional family cooking. It has become a favorite during festive occasions and showcases the heartiness and flavors of German cuisine."
  },
  {
    "dish_name": "Königsberger Klopse",
    "ingredients": {
      "ground veal": "500g",
      "bread crumbs": "50g",
      "onion": "1",
      "anchovy fillets": "6",
      "capers": "2 tbsp"
    },
    "instructions": [
      "Mix ground veal with bread crumbs and finely chopped onion.",
      "Form into meatballs with anchovy fillet centers.",
      "Cook in broth until done, then add capers to the sauce.",
      "Serve with boiled potatoes or rice."
    ],
    "history": "Königsberger Klopse is a classic German dish, especially popular in the region of Königsberg (now Kaliningrad). These meatballs, often made with veal, are cooked in a flavorful broth and served with a caper sauce. The dish has its roots in Prussian and Baltic culinary traditions."
  },
  {
    "dish_name": "Apfelstrudel",
    "ingredients": {
      "apples": "6",
      "sugar": "100g",
      "breadcrumbs": "50g",
      "cinnamon": "1 tsp",
      "phyllo pastry": "6 sheets"
    },
    "instructions": [
      "Peel and slice apples, then mix with sugar and cinnamon.",
      "Spread breadcrumbs on phyllo pastry, then add the apple mixture.",
      "Roll into a strudel shape.",
      "Bake until golden brown and serve with powdered sugar."
    ],
    "history": "Apfelstrudel, or apple strudel, is a delightful German dessert with a history dating back to the Austro-Hungarian Empire. The thin layers of phyllo pastry encase a sweet and spiced apple filling. Apfelstrudel has become a beloved treat, often enjoyed with a dusting of powdered sugar."
  }
]